        // პირველ რიგში, prompt-ის გამოყენებით მოვითხოვთ პირველი რიცხვის შემოტანას
        let number1 = prompt("შემოიტანეთ პირველი რიცხვი:");

        // შემოტანილი მონაცემების გადაყვანა რიცხვად
        number1 = parseFloat(number1);

        // prompt-ის გამოყენებით მოვითხოვთ მეორე რიცხვის შემოტანას
        let number2 = prompt("შემოიტანეთ მეორე რიცხვი:");

        // შემოტანილი მონაცემების გადაყვანა რიცხვად
        number2 = parseFloat(number2);

        // ორ რიცხვს შორის არითმეტიკული ოპერაციის გამოყენება
        let result = number1 + number2; // მაგალითად, მიმატება

        // შედეგის ჩვენება
        alert("შედეგი არის: " + result);